Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To learn about how you can protect service applications by using OIDC Bearer token authentication, see xref:security-oidc-bearer-token-authentication-tutorial.adoc[OIDC Bearer token authentication tutorial].
ja_jp: OIDCベアラートークン認証を使用してサービスアプリケーションを保護する方法については、 xref:security-oidc-bearer-token-authentication-tutorial.adoc[OIDCベアラートークン認証チュートリアル] を参照してください。

source: To learn about how you can protect web applications by using the OIDC Authorization Code Flow mechanism, see xref:security-oidc-code-flow-authentication-tutorial.adoc[Protect a web application by using OIDC authorization code flow].
ja_jp: OIDC 認可コードフローメカニズムを使用して Web アプリケーションを保護する方法については、xref:security-oidc-code-flow-authentication-tutorial.adoc[OIDC 認可コードフローを使用した Web アプリケーションの保護] を参照してください。

source: To learn about how you can protect web applications by using the OIDC authorization code flow mechanism, see xref:security-oidc-code-flow-authentication-tutorial.adoc[Protect a web application by using OIDC authorization code flow]
ja_jp: OIDC認可コードフローメカニズムを使用してWebアプリケーションを保護する方法については、 xref:security-oidc-code-flow-authentication-tutorial.adoc[OIDC認可コードフローを使用したWebアプリケーション保護] を参照してください。

source: To learn about security authentication in Quarkus and the supported mechanisms and protocols, see the Quarkus xref:security-authentication-mechanisms.adoc[Authentication mechanisms in Quarkus] guide.
ja_jp: Quarkusのセキュリティ認証と、サポートされているメカニズムやプロトコルについては、 xref:security-authentication-mechanisms.adoc[Quarkusの認証メカニズム] を参照してください。

source: To learn how it can be done, follow the xref:security-openid-connect-client.adoc[OpenID Connect client and token propagation] quickstart, and its xref:security-openid-connect-client.adoc#testing[Testing] section in particular.
ja_jp: その方法については、xref:security-openid-connect-client.adoc[OpenID Connect クライアントとトークンの伝播] クイックスタート、特に xref:security-openid-connect-client.adoc#testing[テスト] セクションを参照してください。

source: To learn how it can be done, please follow the xref:security-openid-connect-client.adoc[OpenID Connect client and token propagation] quickstart, and its xref:security-openid-connect-client.adoc#testing[Testing] section in particular.
ja_jp: 実行方法については、xref:security-openid-connect-client.adoc[OpenID Connect クライアントとトークンの伝播] クイックスタート、特に xref:security-openid-connect-client.adoc#testing[テスト] セクションを参照してください。

source: To learn more about Keycloak Authorization Services and the policy enforcer, visit the official documentation: https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_overview[Keycloak Authorization Services Documentation].
ja_jp: Keycloak Authorization Services とポリシーエンフォーサーの詳細は、公式ドキュメントを参照してください: https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_overview[Keycloak Authorization Services ドキュメント]

source: To learn more about Qute, please refer to the xref:qute-reference.adoc[Qute reference guide].
ja_jp: Qute について詳しく知りたい方は、 link:qute-reference[Qute リファレンスガイド] を参考にしてください。

source: To learn more about RESTEasy Reactive, see:
ja_jp: RESTEasy Reactiveの詳細については、こちらをご覧ください。

source: To learn more about `io_uring`, we recommend the following links:
ja_jp: `io_uring` についてもっと知るには、以下のリンクをお勧めします：

source: To learn more about it, see our link:/guides/transaction#programmatic-approach[Using Transactions guide].
ja_jp: 詳しくは、 link:/guides/transaction#programmatic-approach[トランザクションの使用ガイド] をご覧ください。

source: To learn more about persistence in Kogito visit https://github.com/kiegroup/kogito-runtimes/wiki/Persistence[this page]
ja_jp: Kogito の永続化について詳しく知りたい方は link:https://github.com/kiegroup/kogito-runtimes/wiki/Persistence[こちらのページ] をご覧ください。

source: To learn more about the Keycloak Admin Client, please refer to its https://www.keycloak.org/docs/latest/server_development/#example-using-java[reference guide].
ja_jp: Keycloak Admin Clientの詳細については、 link:https://www.keycloak.org/docs/latest/server_development/#example-using-java[リファレンスガイド] を参照してください。

source: To learn more about the Quarkus Infinispan extension, check xref:infinispan-client-reference.adoc[the Infinispan Client extension reference guide].
ja_jp: Quarkus Infinispanエクステンションの詳細については、 xref:infinispan-client-reference.adoc[Infinispan Clientエクステンションのリファレンスガイド] を参照してください。

source: To learn more about the Quarkus Redis extension, check xref:redis-reference.adoc[the Redis extension reference guide].
ja_jp: Quarkus Redisエクステンションの詳細については、 xref:redis-reference.adoc[Redis エクステンションリファレンスガイド] を参照してください。

source: To learn more about the changes in Hibernate ORM 6 from a Quarkus user perspective, see https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[Hibernate ORM 5 to 6 migration].
ja_jp: Quarkusユーザーの視点から見たHibernate ORM 6の変更点の詳細については、 https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[Hibernate ORM 5から6へのマイグレーション] を参照してください。

source: To learn more about the internal design and choices, check the https://dl.acm.org/doi/10.1145/3583678.3596895[Considerations for integrating virtual threads in a Java framework: a Quarkus example in a resource-constrained environment] paper.
ja_jp: 内部設計と選択の詳細については、link:https://dl.acm.org/doi/10.1145/3583678.3596895[Considerations for integrating virtual threads in Java framework: a Quarkus example in resource-constrained environment] を参照してください。

source: To learn more about the usage of the Vert.x Mutiny API, refer to https://smallrye.io/smallrye-mutiny-vertx-bindings.
ja_jp: Vert.x Mutiny APIの使用方法について詳しくは、 https://smallrye.io/smallrye-mutiny-vertx-bindings を参照してください。

source: To learn more about this effort, check out https://developers.redhat.com/devnation/tech-talks/integrate-loom-quarkus[the video of Clément's and Arthur's talk].
ja_jp: この取り組みについて詳しく知りたい方は、 link:https://developers.redhat.com/devnation/tech-talks/integrate-loom-quarkus[クレマンとアーサーの講演動画] をご覧ください。

source: To leverage OpenShift S2I to build the container image on the cluster and use the resulting container image for the Knative application, set the following configuration properties:
ja_jp: OpenShift S2Iを活用してクラスタ上でコンテナイメージをビルドし、得られたコンテナイメージをKnativeアプリケーションに使用するには、以下の設定プロパティを設定します：

source: To list the available versions of Java, use `sdk list java`. You can then install the version of OpenJDK you want with `sdk install java x.y.z-open` (or the JDK of another vendor if it is your preference).
ja_jp: 使用可能な Java のバージョンを一覧表示するには、 `sdk list java` を使用します。続いて、 `sdk install java x.y.z-open` (または、必要に応じて別のベンダーの JDK) を使用して、必要なバージョンの OpenJDK をインストールできます。

source: To list the available/installable plugins:
ja_jp: 利用可能/インストール可能なプラグインを一覧表示します：

source: To load SQL statements when Hibernate ORM starts, add an `import.sql` file to the root of your `resources` directory. This script can contain any SQL DML statements. Make sure to terminate each statement with a semicolon.
ja_jp: Hibernate ORMの起動時にSQL文をロードするには、 `import.sql` ファイルをresourcesディレクトリーのルートに追加します。 このスクリプトには、任意のSQL DML文を含めることができます。 各ステートメントは必ずセミコロンで終了させてください。

source: To load SQL statements when Hibernate ORM starts, add an `import.sql` file to the root of your resources directory. This script can contain any SQL DML statements. Make sure to terminate each statement with a semicolon.
ja_jp: Hibernate ORMの起動時にSQL文をロードするには、 `import.sql` ファイルをresourcesディレクトリーのルートに追加します。このスクリプトには、任意のSQL DML文を含めることができます。各ステートメントは必ずセミコロンで終了させてください。

source: To load SQL statements when Hibernate Reactive starts, add an `import.sql` file in your `src/main/resources/` directory. This script can contain any SQL DML statements. Make sure to terminate each statement with a semicolon.
ja_jp: Hibernate Reactive の起動時に SQL 文をロードするには、 `src/main/resources/` ディレクトリに `import.sql` ファイルを追加します。このスクリプトには、任意の SQL DML ステートメントを含めることができます。各ステートメントは必ずセミコロンで終了させてください。

source: To load entities from an external datasource in order to reindex them, see https://docs.hibernate.org/stable/search/reference/en-US/html_single/#mapping-entitydefinition-loading-mass[Mass loading strategy].
ja_jp: エンティティーを外部データソースからロードして再インデックスする場合は、 https://docs.hibernate.org/stable/search/reference/en-US/html_single/#mapping-entitydefinition-loading-mass[一括ロード ストラテジー] を参照してください。

source: To load entities from an external datasource in order to reindex them, see https://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/#mapping-entitydefinition-loading-mass[Mass loading strategy].
ja_jp: 外部データソースからエンティティーをロードして再インデックスする場合は、 https://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/#mapping-entitydefinition-loading-mass[一括ローディングストラテジー] を参照してください。

source: To load entities from an external datasource when returning search hits, see https://docs.hibernate.org/stable/search/reference/en-US/html_single/#mapping-entitydefinition-loading-selection[Selection loading strategy].
ja_jp: 検索ヒットを返すときに外部データソースからエンティティーをロードする場合は、 https://docs.hibernate.org/stable/search/reference/en-US/html_single/#mapping-entitydefinition-loading-selection[選択ロード ストラテジー] を参照してください。

source: To load entities from an external datasource when returning search hits, see https://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/#mapping-entitydefinition-loading-selection[Selection loading strategy].
ja_jp: 検索ヒットを返すときに外部データソースからエンティティーをロードするには、 https://docs.jboss.org/hibernate/stable/search/reference/en-US/html_single/#mapping-entitydefinition-loading-selection[選択ロードストラテジー] を参照してください。

source: To log events to a file on the application's host, use the Quarkus file log handler. The file log handler is disabled by default, so you must enable it first.
ja_jp: アプリケーションのホスト上のファイルにイベントを記録するには、Quarkus ファイルログハンドラーを使用します。ファイルログハンドラーはデフォルトで無効になっているため、最初に有効にする必要があります。

source: To log events to a file on the application's host, use the Quarkus file log handler. The file log handler is disabled by default, so you must first enable it.
ja_jp: アプリケーションのホスト上のファイルにイベントをログ記録するには、Quarkusのファイルログハンドラを使用します。 ファイルログハンドラはデフォルトで無効になっているため、最初に有効にする必要があります。

source: To log out of the SPA from the client, the cookie must be set to `quarkus.http.auth.form.http-only-cookie=false` so you can destroy the cookie and possibly redirect back to your main page.
ja_jp: SPA でクライアント側から ログアウトするには、Cookie を `quarkus.http.auth.form.http-only-cookie=false` に設定して、Cookie を破棄し、 t可能であればメインページにリダイレクトできるようにする必要があります。

source: To log out of the SPA from the server, the cookie can be set to `quarkus.http.auth.form.http-only-cookie=true` and use this example code to destroy the cookie.
ja_jp: SPA でサーバー側から ログアウトするには、Cookie を `quarkus.http.auth.form.http-only-cookie=true` に設定し、このサンプルコードを使用して Cookie を破棄します。

source: To maintain backwards compatibility, the extension uses the Prometheus client v0.x from Micrometer 1.13+, instead of their default v1.x client.
ja_jp: 後方互換性を維持するため、このエクステンションではデフォルトのv1.xクライアントの代わりに、Micrometer 1.13+のPrometheusクライアントv0.xを使用しています。

source: To maintain visual consistency with other Dev Assistant features, use the following components and styles:
ja_jp: 他の Dev Assistant 機能と視覚的な一貫性を保つために、以下のコンポーネントとスタイルを使用してください。

source: To make Dev UI more helpful in supporting the development of OIDC `web-app` applications, consider setting profile-specific values for `quarkus.oidc.application-type`:
ja_jp: Dev UI を OIDC `web-app` アプリケーションの開発のサポートにさらに役立てるために、 `quarkus.oidc.application-type` にプロファイル固有の値を設定することを検討してください。

source: To make Dev UI more useful for supporting the development of OIDC `web-app` applications you may want to consider setting profile specific values for `quarkus.oidc.application-type`:
ja_jp: Dev UI が OIDC `web-app` アプリケーションの開発をより便利にサポートできるようにするために、 `quarkus.oidc.application-type` のプロファイル固有値を設定することを検討してください。

source: To make build time data available on your full page, you can add any data to your `CardPageBuildItem` with a key and a value:
ja_jp: ビルド時データをページ全体で利用できるようにするには、キーと値を使用して任意のデータを `CardPageBuildItem` に追加します。

source: To make documents processing, graphics, PDFs, etc. available for the application, you can install the required libraries using `microdnf` without manually copying anything:
ja_jp: ドキュメント処理、グラフィック、PDF などをアプリケーションで利用できるようにするには、何も手動でコピーすることなく `microdnf` を使用して必要なライブラリーをインストールできます:

source: To make it easier to showcase some capabilities of Hibernate ORM with Panache on Quarkus with Dev mode, some test data should be inserted into the database by adding the following content to a new file named src/main/resources/import.sql:
ja_jp: DevモードのQuarkusでHibernate ORM with Panacheの機能を簡単に紹介するために、src/main/resources/import.sqlという新しいファイルに次の内容を追加して、いくつかのテストデータをデータベースに挿入する必要があります:

source: To make it easier to showcase some capabilities of Spring Data JPA on Quarkus, some test data should be inserted into the database by adding the following content to a new file named `src/main/resources/import.sql`:
ja_jp: Quarkus で Spring DataJ PA の一部の機能を簡単に示すために、次のコンテンツを `src/main/resources/import.sql` という名前の新しいファイルに追加して、データベースにテストデータを挿入する必要があります。

source: To make it easier to showcase some capabilities of Spring Data REST on Quarkus, some test data should be inserted into the database by adding the following content to a new file named `src/main/resources/import.sql`:
ja_jp: QuarkusにおけるSpring Data RESTの機能の一部を簡単に紹介するために、以下の内容を `src/main/resources/import.sql` という名前の新しいファイルに追加して、いくつかのテストデータをデータベースに挿入する必要があります:

source: To make sure that the code block adopt the correct code-mirror theme (based on the current one in Dev UI), you can do the following:
ja_jp: コードブロックが正しい code-mirror テーマ (Dev UI の現在のテーマに基づく) を採用していることを確認するには、次の操作を実行します。

source: To make testing against a mock Kubernetes API extremely simple, Quarkus provides the `WithKubernetesTestServer` annotation which automatically launches a mock of the Kubernetes API server and sets the proper environment variables needed so that the Kubernetes Client configures itself to use said mock. Tests can inject the mock server and set it up in any way necessary for the particular testing using the `@KubernetesTestServer` annotation.
ja_jp: モックのKubernetes APIに対するテストを非常に簡単にするために、Quarkusでは、Kubernetes APIサーバーのモックを自動的に起動し、Kubernetesクライアントがそのモックを使用するように設定するために必要な適切な環境変数を設定する `KubernetesMockServerTestResource` を提供しています。テストは、 `@MockServer` アノテーションを使用して、特定のテストに必要な方法でモックを注入し、設定することができます。

source: To make the generated resources Git-Ops friendly and only produce idempotent resources (resources that won't change every time we build the sources), we need to add the following property:
ja_jp: 生成されるリソースをGit-Opsに対応させ、冪等なリソース（ソースをビルドするたびに変化しないリソース）だけを生成するには、次のプロパティーを追加する必要があります:

source: To make the simple experience easiest, unify the configuration in `application.properties` via SmallRye Config. Avoid library specific configuration files, or at least make them optional: e.g. `persistence.xml` for Hibernate ORM is optional.
ja_jp: シンプルな体験を最も簡単にするために、SmallRye Configを介して `application.properties` で設定を統一します。ライブラリ固有の設定ファイルは避けるか、少なくともオプションにしてください。例えば、Hibernate ORM用の `persistence.xml` はオプションです。

source: To make the test pass, we also need to update `ReactiveGreetingResourceTest.kt` like so:
ja_jp: テストをパスするためには、 `ReactiveGreetingResourceTest.kt` を次のように更新する必要があります。

source: To make the test pass, we also need to update `ReactiveGreetingResourceTest` like so:
ja_jp: テストをパスするためには、 `ReactiveGreetingResourceTest` を次のように更新します:

source: To make your Quarkus application accessible to another application running on a different domain, you need to configure cross-origin resource sharing (CORS). For more information about the CORS filter Quarkus provides, see the xref:security-cors.adoc#cors-filter[CORS filter] section of the Quarkus "Cross-origin resource sharing" guide.
ja_jp: Quarkus アプリケーションを別のドメインで実行されている別のアプリケーションからアクセスできるようにするには、クロスオリジンリソース共有 (CORS) を設定する必要があります。 Quarkus が提供する CORS フィルターの詳細は、Quarkus 「クロスオリジンリソース共有ガイド」の xref:security-cors.adoc#cors-filter[CORS フィルター] セクションを参照してください。

source: To make your Quarkus application accessible to another application running on a different domain, you need to configure cross-origin resource sharing (CORS). For more information about the CORS filter that Quarkus provides, see the Quarkus xref:http-reference.adoc#cors-filter[CORS filter] section of the "HTTP reference" guide.
ja_jp: Quarkusアプリケーションを別のドメインで実行されている別のアプリケーションからアクセスできるようにするには、CORS（Cross-Origin Resource Sharing）を設定する必要があります。 Quarkusが提供するCORSフィルターの詳細については、「HTTPリファレンス」ガイドのQuarkus xref:http-reference.adoc#cors-filter[CORSフィルター] のセクションを参照してください。

source: To make your Quarkus application accessible to another application running on a different domain, you need to configure cross-origin resource sharing (CORS). For more information about the CORS filter that Quarkus provides, see the Quarkus xref:security-cors.adoc#cors-filter[CORS filter] section of the "Cross-origin resource sharing" guide.
ja_jp: Quarkusアプリケーションを別のドメインで実行されている別のアプリケーションからアクセスできるようにするには、クロスオリジンリソース共有（CORS）を設定する必要があります。 Quarkusが提供するCORSフィルターの詳細については、クロスオリジンリソース共有ガイドのQuarkus xref:security-cors.adoc#cors-filter[CORSフィルター] のセクションを参照してください。

source: To make your Quarkus application accessible to another application running on a different domain, you need to configure cross-origin resource sharing (CORS). For more information about the CORS filter that is provided by Quarkus, see the xref:http-reference.adoc#cors-filter[HTTP reference] information.
ja_jp: Quarkusアプリケーションを別のドメインで実行されている別のアプリケーションからアクセスできるようにするには、CORS（Cross-Origin Resource Sharing）を設定する必要があります。 Quarkusが提供するCORSフィルターの詳細については、 xref:http-reference.adoc#cors-filter[HTTPリファレンス] 情報を参照してください。

source: To make your applications work with Cloud SQL, you first need to use the corresponding JDBC extension, for example, for PostgreSQL, add the `quarkus-jdbc-postgresql` extension.
ja_jp: アプリケーションをCloud SQLで動作させるには、まず対応するJDBCエクステンションを使用する必要があります。例えば、PostgreSQLの場合は、 `quarkus-jdbc-postgresql` エクステンションを追加します。

source: To make your exception mapper blocking, you can annotate the exception mapper with the `@Blocking` annotation:
ja_jp: 例外マッパーをブロッキングにするには、例外マッパーに `@Blocking` アノテーションを付けます。

source: To make your extension listed in the Dev UI, you don't need to do anything!
ja_jp: 何をしなくても、Dev UI にエクステンションが表示されます。

source: To manipulate bytecode during the build, Quarkus offers the `BytecodeTransformerBuildItem`. Adjusting the bytecode of a class is just a matter of producing one for the given class.
ja_jp: ビルド中にバイトコードを操作するために、Quarkusは `BytecodeTransformerBuildItem` を提供します。 クラスのバイトコードを調整するには、与えられたクラスに対してバイトコードを生成するだけです。

source: To map an environment variable to a specific application configuration property, use the `io.quarkus.devservices.compose.config_map.env.<env-var-name>` label.
ja_jp: 環境変数を特定のアプリケーション設定プロパティーにマッピングするには、 `io.quarkus.devservices.compose.config_map.env.<env-var-name>` ラベルを使用します。

source: To map an exposed port to a specific application configuration property, use the `io.quarkus.devservices.compose.config_map.port.<container-port>` label:
ja_jp: 公開ポートを特定のアプリケーション設定プロパティーにマッピングするには、 `io.quarkus.devservices.compose.config_map.port.<container-port>` ラベルを使用します:

source: To mark a context as safe, you can:
ja_jp: コンテキストをセーフとしてマークするには、次のようにします：

source: To measure accurately, a similar set of steps for measuring RSS on Linux should be performed. The docker `top` command allows running a `ps` command on the container host machine against the processes in the container instance. By utilizing this in combination with formatting output parameters, the rss value can be returned:
ja_jp: 正確に測定するためには、Linux上でRSSを測定するのと同様の手順を実行する必要があります。docker `top` コマンドは、コンテナインスタンス内のプロセスに対して、コンテナホストマシン上で `ps` コマンドを実行することができます。これを出力パラメータのフォーマットと組み合わせて利用することで、RSSの値を返すことができます:

source: To migrate between the two frameworks, you must drop the old `quarkus-smallrye-opentracing` extension and replace it by the `quarkus-opentelemetry` extension in the build file:
ja_jp: 2 つのフレームワーク間で移行するには、ビルドファイルで古い `quarkus-smallrye-opentracing` エクステンションを削除し、それを `quarkus-opentelemetry` エクステンションに置き換える必要があります。

source: To migrate from 2.0, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.1[our migration guide].
ja_jp: 2.0からの移行は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.1[移行ガイド]をご参照ください。

source: To migrate from 2.1, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.2[our migration guide].
ja_jp: 2.1からの移行は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.2[移行ガイド]をご参照ください。

source: To migrate from 2.10, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.11[our migration guide].
ja_jp: 2.10からの移行は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.11[移行ガイド] をご参照ください。

source: To migrate from 2.11, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.12[our migration guide].
ja_jp: 2.11からの移行は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.12[移行ガイド] をご参照ください。

source: To migrate from 2.12, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.13[our migration guide].
ja_jp: 2.12からの移行は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.13[移行ガイド] を参照してください。

source: To migrate from 2.13, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.14[our migration guide].
ja_jp: 2.13から移行する場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.14[移行ガイド] をご参照ください。

source: To migrate from 2.2, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.3[our migration guide].
ja_jp: 2.2からの移行については、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.3[移行ガイド]をご参照ください。

source: To migrate from 2.3, please refer to link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.4[our migration guide].
ja_jp: 2.3からの移行については、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.4[移行ガイド]を参照ください。

source: To migrate from 2.4, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.5[our migration guide].
ja_jp: 2.4からの移行については、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.5[移行ガイド] をご参照ください。

source: To migrate from 2.5, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.6[our migration guide].
ja_jp: 2.5からの移行については、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.6[移行ガイド]をご参照ください。

source: To migrate from 2.6, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.7[our migration guide].
ja_jp: 2.6からの移行については、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.7[移行ガイド]をご参照ください。

source: To migrate from 2.7, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.8[our migration guide].
ja_jp: 2.7からの移行は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.8[移行ガイド]を参照してください。

source: To migrate from 2.8, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.9[our migration guide].
ja_jp: 2.8から移行する場合は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.9[移行ガイド] をご参照ください。

source: To migrate from 2.9, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.10[our migration guide].
ja_jp: 2.9からの移行は、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.10[移行ガイド] を参照してください。

source: To migrate from 3.3, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.4[our migration guide].
ja_jp: 3.3からの移行については、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.4[移行ガイドを] ご参照ください。

source: To mirror the AWS Lambda environment as closely as possible in a dev environment, the Quarkus AWS Lambda extension boots up a mock AWS Lambda event server in Quarkus Dev and Test mode. This mock event server simulates a true AWS Lambda environment.
ja_jp: 開発環境でAWS Lambda環境をできるだけ忠実にミラーリングするために、 Quarkus AWS Lambdaエクステンションは、Quarkus Dev and TestモードでAWS Lambdaイベントサーバーのモックを起動します。 このモックイベントサーバーは、真のAWS Lambda環境をシミュレートします。
